Repository: tashri-dev/Salawaty
Catalog: Sources/Localizable.xcstrings
Source language: en
Languages: ar, fr, id, tr, ur

source: Indeed, prayer prohibits immorality and wrongdoing.
fr: En vérité, la prière préserve de la turpitude et du blâmable.
id: Sesungguhnya salat itu mencegah dari (perbuatan) keji dan mungkar.
tr: Şüphesiz namaz, çirkin işlerden ve kötülükten alıkoyar.
ur: بے شک نماز بے حیائی اور برائی سے روکتی ہے۔

source: Say: O My servants who have transgressed against themselves, do not despair of the mercy of Allah.
fr: Dis : « Ô Mes serviteurs qui avez commis des excès à votre propre détriment, ne désespérez pas de la miséricorde d'Allah. »
id: Katakanlah: Wahai hamba-hamba-Ku yang melampaui batas terhadap diri mereka sendiri, janganlah kamu berputus asa dari rahmat Allah.
tr: De ki: Ey kendi aleyhlerine aşırı giden kullarım! Allah'ın rahmetinden ümidinizi kesmeyin.
ur: کہہ دو: اے میرے بندو جنہوں نے اپنی جانوں پر زیادتی کی، اللہ کی رحمت سے مایوس نہ ہو۔

source: They said, "Upon Allah we rely. Our Lord, do not make us a trial for the wrongdoing people."
fr: Ils dirent : « C'est en Allah que nous plaçons notre confiance. Notre Seigneur, ne fais pas de nous une épreuve pour les injustes. »
id: Mereka berkata: Hanya kepada Allah kami bertawakal. Ya Tuhan kami, janganlah Engkau jadikan kami sasaran fitnah bagi kaum yang zalim.
tr: Dediler ki: Allah'a güvendik. Rabbimiz! Bizi zalim topluluk için bir fitne kılma.
ur: انہوں نے کہا: ہم نے اللہ پر بھروسہ کیا۔ اے ہمارے رب! ہمیں ظالم قوم کے لیے آزمائش نہ بنا۔

source: Dua after the adhan: O Allah, Lord of this perfect call and the prayer about to be established, grant Muhammad al-Wasilah and virtue, and raise him to the praised station You promised him.
fr: Invocation après l'adhan : Ô Allah, Seigneur de cet appel parfait et de la prière qui va être établie, accorde à Muhammad al-Wasîla et la vertu, et élève-le à la station louée que Tu lui as promise.
id: Doa setelah azan: Ya Allah, Tuhan pemilik seruan yang sempurna ini dan salat yang akan didirikan, berikanlah kepada Muhammad wasilah dan keutamaan, dan bangkitkanlah ia pada kedudukan terpuji yang telah Engkau janjikan kepadanya.
tr: Ezandan sonraki dua: Allah'ım! Bu eksiksiz davetin ve kılınacak namazın Rabbi! Muhammed'e vesile ve fazileti ver, onu vadettiğin makam-ı mahmuda ulaştır.
ur: اذان کے بعد کی دعا: اے اللہ! اس کامل پکار اور قائم ہونے والی نماز کے رب! محمد ﷺ کو وسیلہ اور فضیلت عطا فرما، اور انہیں اس مقامِ محمود پر فائز فرما جس کا تو نے وعدہ کیا ہے۔
